# Mini-Project: Data Wrangling and Transformation with Pandas

Working with tabular data is a necessity for anyone with enterprises having a majority of their data in relational databases and flat files. This mini-project is adopted from the excellent tutorial on pandas by Brandon Rhodes which you have watched earlier in the Data Wrangling Unit. In this mini-project, we will be looking at some interesting data based on movie data from the IMDB.

This assignment should help you reinforce the concepts you learnt in the curriculum for Data Wrangling and sharpen your skills in using Pandas. Good Luck!

### Please make sure you have one of the more recent versions of Pandas

In [3]:
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

In [4]:
pd.__version__

'1.3.2'

## Taking a look at the Movies dataset
This data shows the movies based on their title and the year of release

In [5]:
movies = pd.read_csv('titles.csv')
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244914 entries, 0 to 244913
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   244914 non-null  object
 1   year    244914 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [6]:
movies.head()

                                          title  year
0                        The Ticket to the Life  2009
1  Parallel Worlds: A New Rock Music Experience  2016
2                     Morita - La hija de Jesus  2008
3                                           Gun  2017
4                        Love or Nothing at All  2014

## Taking a look at the Cast dataset

This data shows the cast (actors, actresses, supporting roles) for each movie

- The attribute `n` basically tells the importance of the cast role, lower the number, more important the role.
- Supporting cast usually don't have any value for `n`

In [7]:
cast = pd.read_csv('cast.csv.zip')
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3786176 entries, 0 to 3786175
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 173.3+ MB

In [8]:
cast.head(10)

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
8,"Lapis, Ballpen at Diploma, a True to Life Journey",2014,Jori ' Danilo' Jurado Jr.,actor,Jaime (young),9.0
9,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN

## Taking a look at the Release dataset

This data shows details of when each movie was release in each country with the release date

In [9]:
release_dates = pd.read_csv('release_dates.csv', parse_dates=['date'], infer_datetime_format=True)
release_dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 479488 entries, 0 to 479487
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   title    479488 non-null  object
 1   year     479488 non-null  int64
 2   country  479488 non-null  object
 3   date     479488 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 14.6+ MB

In [10]:
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                   #BKKY  2016     Cambodia 2017-10-12
2                 #Beings  2015      Romania 2015-01-29
3               #Captured  2017          USA 2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21

# Section I - Basic Querying, Filtering and Transformations

### What is the total number of movies?

In [11]:
len(movies)

244914

### List all Batman movies ever made

In [15]:
batman_df = movies[movies.title == 'Batman']
print('Total Batman Movies:', len(batman_df))
batman_df

Total Batman Movies: 2

         title  year
52734   Batman  1943
150621  Batman  1989

### List all Batman movies ever made - the right approach

In [16]:
batman_df = movies[movies.title.str.contains('Batman', case=False)]
print('Total Batman Movies:', len(batman_df))
batman_df.head(10)

Total Batman Movies: 35

                                             title  year
16813                              Batman: Anarchy  2016
30236                               Batman Forever  1995
31674                                Batman Untold  2010
31711  Scooby-Doo & Batman: the Brave and the Bold  2018
41881                  Batman the Rise of Red Hood  2018
43484        Batman: Return of the Caped Crusaders  2016
46333                               Batman & Robin  1997
51811                              Batman Revealed  2012
52734                                       Batman  1943
56029                 Batman Beyond: Rising Knight  2014

### Display the top 15 Batman movies in the order they were released

In [17]:
batman_df.sort_values(by=['year'], ascending=True).iloc[:15]

                               title  year
52734                         Batman  1943
100056              Batman and Robin  1949
161439                Batman Dracula  1964
84327          Alyas Batman at Robin  1965
68364                   James Batman  1966
161527             Batman: The Movie  1966
56159          Batman Fights Dracula  1967
168504         Fight! Batman, Fight!  1973
150621                        Batman  1989
156239         Alyas Batman en Robin  1991
156755                Batman Returns  1992
63366   Batman: Mask of the Phantasm  1993
30236                 Batman Forever  1995
46333                 Batman & Robin  1997
208220                 Batman Begins  2005

### Section I - Q1 : List all the 'Harry Potter' movies from the most recent to the earliest

In [22]:
hp = movies[movies.title.str.contains('Harry Potter', case=False)]
print(f'Total Harry Potter movies: {len(hp)}')
hp.sort_values(by=['year'], ascending=False)

Total Harry Potter movies: 8

                                               title  year
143147  Harry Potter and the Deathly Hallows: Part 2  2011
152831  Harry Potter and the Deathly Hallows: Part 1  2010
109213        Harry Potter and the Half-Blood Prince  2009
50581      Harry Potter and the Order of the Phoenix  2007
187926           Harry Potter and the Goblet of Fire  2005
61957       Harry Potter and the Prisoner of Azkaban  2004
82791        Harry Potter and the Chamber of Secrets  2002
223087         Harry Potter and the Sorcerer's Stone  2001

### How many movies were made in the year 2017?

In [23]:
len(movies[movies.year == 2017])

11474

### Section I - Q2 : How many movies were made in the year 2015?

In [24]:
len(movies[movies.year == 2015])

8702

### Section I - Q3 : How many movies were made from 2000 till 2018?
- You can chain multiple conditions using OR (`|`) as well as AND (`&`) depending on the condition

In [34]:
len(movies[movies.year.between(2000, 2018)])

114070

### Section I - Q4: How many movies are titled "Hamlet"?

In [35]:
hm = movies[movies.title == 'Hamlet']
print(f'Total Hamlet movies: {len(hm)}')

Total Hamlet movies: 20

### Section I - Q5: List all movies titled "Hamlet" 
- The movies should only have been released on or after the year 2000
- Display the movies based on the year they were released (earliest to most recent)

In [48]:
hm = hm[hm.year >= 2000].sort_values(by=['year'], ascending=True)
print(f'Total Hamlet  movies after 2000: {len(hm)}')
print(hm)

Total Hamlet  movies after 2000: 7
         title  year
55639   Hamlet  2000
1931    Hamlet  2009
227953  Hamlet  2011
178290  Hamlet  2014
186137  Hamlet  2015
191940  Hamlet  2016
244747  Hamlet  2017

### Section I - Q6: How many roles in the movie "Inception" are of the supporting cast (extra credits)
- supporting cast are NOT ranked by an "n" value (NaN)
- check for how to filter based on nulls

In [61]:
# cast.info()
_inc_cast = cast[cast.title == 'Inception']
_support = _inc_cast['n'].isnull().sum()
print(f'Total roles in Inception: {len(_inc_cast)}')
print(f'Total supporting roles in Inception: {_support}')

Total roles in Inception: 78
Total supporting roles in Inception: 27

### Section I - Q7: How many roles in the movie "Inception" are of the main cast
- main cast always have an 'n' value

In [62]:
_inc_cast = cast[cast.title == 'Inception']
_main = _inc_cast['n'].notnull().sum()
print(f'Total roles in Inception: {len(_inc_cast)}')
print(f'Total main roles in Inception: {_main}')

Total roles in Inception: 78
Total main roles in Inception: 51

### Section I - Q8: Show the top ten cast (actors\actresses) in the movie "Inception" 
- main cast always have an 'n' value
- remember to sort!

In [117]:
_inc_cast = cast[(cast.title == 'Inception') & (cast.n.between(1, 10))].sort_values(by=['n'], ascending=True)
print(_inc_cast)

             title  year                  name     type        character     n
590576   Inception  2010     Leonardo DiCaprio    actor             Cobb   1.0
859993   Inception  2010  Joseph Gordon-Levitt    actor           Arthur   2.0
3387147  Inception  2010            Ellen Page  actress          Ariadne   3.0
940923   Inception  2010             Tom Hardy    actor            Eames   4.0
2406531  Inception  2010          Ken Watanabe    actor            Saito   5.0
1876301  Inception  2010            Dileep Rao    actor            Yusuf   6.0
1615709  Inception  2010        Cillian Murphy    actor   Robert Fischer   7.0
183937   Inception  2010          Tom Berenger    actor         Browning   8.0
2765969  Inception  2010      Marion Cotillard  actress              Mal   9.0
1826027  Inception  2010    Pete Postlethwaite    actor  Maurice Fischer  10.0

### Section I - Q9:

(A) List all movies where there was a character 'Albus Dumbledore' 

(B) Now modify the above to show only the actors who played the character 'Albus Dumbledore'
- For Part (B) remember the same actor might play the same role in multiple movies

In [80]:
# cast.info()
_char = cast[cast.character.str.contains('Albus Dumbledore', case=False)]
print(_char)

                                                title  year  \
704984                                     Epic Movie  2007
792419   Harry Potter and the Deathly Hallows: Part 1  2010
792420   Harry Potter and the Deathly Hallows: Part 2  2011
792421            Harry Potter and the Goblet of Fire  2005
792422         Harry Potter and the Half-Blood Prince  2009
792423      Harry Potter and the Order of the Phoenix  2007
792424       Harry Potter and the Prisoner of Azkaban  2004
947789        Harry Potter and the Chamber of Secrets  2002
947790          Harry Potter and the Sorcerer's Stone  2001
1685537                         Ultimate Hero Project  2013
1893421  Harry Potter and the Deathly Hallows: Part 1  2010
2248085                                        Potter  2015

                        name   type                   character     n
704984          Dane Farwell  actor            Albus Dumbledore  17.0
792419        Michael Gambon  actor  Professor Albus Dumbledore  39.0
792420        Michael Gambon  actor  Professor Albus Dumbledore   2.0
792421        Michael Gambon  actor            Albus Dumbledore  37.0
792422        Michael Gambon  actor  Professor Albus Dumbledore   2.0
792423        Michael Gambon  actor            Albus Dumbledore  36.0
792424        Michael Gambon  actor            Albus Dumbledore  27.0
947789        Richard Harris  actor            Albus Dumbledore  32.0
947790        Richard Harris  actor            Albus Dumbledore   1.0
1685537  George (X) O'Connor  actor            Albus Dumbledore   NaN
1893421           Toby Regbo  actor      Young Albus Dumbledore   NaN
2248085    Timothy Tedmanson  actor            Albus Dumbledore   NaN

In [88]:
print(_char['name'].unique())

['Dane Farwell' 'Michael Gambon' 'Richard Harris' "George (X) O'Connor"
 'Toby Regbo' 'Timothy Tedmanson']

### Section I - Q10:

(A) How many roles has 'Keanu Reeves' played throughout his career?

(B) List the leading roles that 'Keanu Reeves' played on or after 1999 in order by year.

In [95]:
_char = cast[cast.name == 'Keanu Reeves']
# _char = cast[cast.name.str.contains('Keanu Reeves', case=False)]
print(f'K. Reeves has played in {len(_char)} movies.')

K. Reeves has played in 62 movies.

In [116]:
_kr = _char[(cast.n == 1) & (cast.year >=1999)].sort_values(by=['year'], ascending=True)
print(_kr)

                                 title  year          name   type  \
1892390                     The Matrix  1999  Keanu Reeves  actor
1892397               The Replacements  2000  Keanu Reeves  actor
1892358                      Hard Ball  2001  Keanu Reeves  actor
1892383                 Sweet November  2001  Keanu Reeves  actor
1892348                    Constantine  2005  Keanu Reeves  actor
1892388                 The Lake House  2006  Keanu Reeves  actor
1892382                   Street Kings  2008  Keanu Reeves  actor
1892385  The Day the Earth Stood Still  2008  Keanu Reeves  actor
1892359                  Henry's Crime  2010  Keanu Reeves  actor
1892342                       47 Ronin  2013  Keanu Reeves  actor
1892361                      John Wick  2014  Keanu Reeves  actor
1892366                    Knock Knock  2015  Keanu Reeves  actor
1892399                The Whole Truth  2016  Keanu Reeves  actor
1892362           John Wick: Chapter 2  2017  Keanu Reeves  actor
1892378                        Siberia  2018  Keanu Reeves  actor

                    character    n
1892390                   Neo  1.0
1892397           Shane Falco  1.0
1892358         Conor O'Neill  1.0
1892383           Nelson Moss  1.0
1892348      John Constantine  1.0
1892388            Alex Wyler  1.0
1892382  Detective Tom Ludlow  1.0
1892385                Klaatu  1.0
1892359           Henry Torne  1.0
1892342                   Kai  1.0
1892361             John Wick  1.0
1892366                  Evan  1.0
1892399                Ramsey  1.0
1892362             John Wick  1.0
1892378            Lucas Hill  1.0

C:\Users\maggi\AppData\Local\Temp/ipykernel_39128/2878244375.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  _kr = _char[(cast.n == 1) & (cast.year >=1999)].sort_values(by=['year'], ascending=True)

### Section I - Q11: 

(A) List the total number of actor and actress roles available from 1950 - 1960

(B) List the total number of actor and actress roles available from 2007 - 2017

In [110]:
_yr = cast[cast.year.between(1950, 1960)]
print(f'Number of roles available from 1950 - 1960: {len(_yr)}')

Number of roles available from 1950 - 1960: 234635

In [111]:
_yr = cast[cast.year.between(2007, 2017)]
print(f'Number of roles available from 2007 - 2017: {len(_yr)}')

Number of roles available from 2007 - 2017: 1452413

### Section I - Q12: 

(A) List the total number of leading roles available from 2000 to present

(B) List the total number of non-leading roles available from 2000 - present (exclude support cast)

(C) List the total number of support\extra-credit roles available from 2000 - present

In [115]:
_lead = cast[(cast.year >= 2000) & (cast.n == 1)]
print(f'Number of roles available from 2000 to Present: {len(_lead)}')

Number of roles available from 2000 to Present: 60568

In [119]:
_nonlead = cast[(cast.year >= 2000) & (cast.n > 1) & cast.n.notnull()]
print(f'Number of non-lead roles available from 2000 to Present: {len(_nonlead)}')

Number of non-lead roles available from 2000 to Present: 1001710

In [121]:
_support = cast[(cast.year >= 2000) & cast.n.isnull()]
print(f'Number of supporting roles available from 2000 to Present: {len(_support)}')

Number of supporting roles available from 2000 to Present: 887484

# Section II - Aggregations, Transformations and Visualizations

## What are the top ten most common movie names of all time?

In [ ]:
top_ten = movies.title.value_counts()[:10]
top_ten

### Plot the top ten common movie names of all time

In [ ]:
top_ten.plot(kind='barh')

### Section II - Q1:  Which years in the 2000s saw the most movies released? (Show top 3)

### Section II - Q2: # Plot the total number of films released per-decade (1890, 1900, 1910,....)
- Hint: Dividing the year and multiplying with a number might give you the decade the year falls into!
- You might need to sort before plotting

### Section II - Q3: 

(A) What are the top 10 most common character names in movie history?

(B) Who are the top 10 people most often credited as "Herself" in movie history?

(C) Who are the top 10 people most often credited as "Himself" in movie history?

### Section II - Q4: 

(A) What are the top 10 most frequent roles that start with the word "Zombie"?

(B) What are the top 10 most frequent roles that start with the word "Police"?

- Hint: The `startswith()` function might be useful

### Section II - Q5: Plot how many roles 'Keanu Reeves' has played in each year of his career.

### Section II - Q6: Plot the cast positions (n-values) of Keanu Reeve's roles through his career over the years.

### Section II - Q7: Plot the number of "Hamlet" films made by each decade

### Section II - Q8: 

(A) How many leading roles were available to both actors and actresses, in the 1960s (1960-1969)?

(B) How many leading roles were available to both actors and actresses, in the 2000s (2000-2009)?

- Hint: A specific value of n might indicate a leading role

### Section II - Q9: List, in order by year, each of the films in which Frank Oz has played more than 1 role.

### Section II - Q10: List each of the characters that Frank Oz has portrayed at least twice

# Section III - Advanced Merging, Querying and Visualizations

## Make a bar plot with the following conditions
- Frequency of the number of movies with "Christmas" in their title 
- Movies should be such that they are released in the USA.
- Show the frequency plot by month

In [ ]:
christmas = release_dates[(release_dates.title.str.contains('Christmas')) & (release_dates.country == 'USA')]
christmas.date.dt.month.value_counts().sort_index().plot(kind='bar')

### Section III - Q1: Make a bar plot with the following conditions
- Frequency of the number of movies with "Summer" in their title 
- Movies should be such that they are released in the USA.
- Show the frequency plot by month

### Section III - Q2: Make a bar plot with the following conditions
- Frequency of the number of movies with "Action" in their title 
- Movies should be such that they are released in the USA.
- Show the frequency plot by week

### Section III - Q3: Show all the movies in which Keanu Reeves has played the lead role along with their   release date in the USA sorted by the date of release
- Hint: You might need to join or merge two datasets!

### Section III - Q4: Make a bar plot showing the months in which movies with Keanu Reeves tend to be released in the USA?

### Section III - Q5: Make a bar plot showing the years in which movies with Ian McKellen tend to be released in the USA?